{"pageProps":{"title":"Document templates are here","slug":"document-templates","date":"2020-08-13T00:00:00.000Z","tag":"","content":"\nToday we’re adding the much-requested ability to create team document templates in Outline.\nTemplates are a simple, but powerful way to keep your docs consistent and reliable. In \nthe near future we’ll also publish recommended templates and make them easy to use from \nwithin your team.\n\n### How to create a template\n\nThere are two ways to create a template:\n\n1. Navigate to \"Templates\" in the left sidebar, then hit \"New template…\" in the top right, \nchoose a collection and write your template.\n2. Find an existing doc that you would like to create a template from, click on the overflow menu \"...\" (usually in the top right) and then \"Create template…\".\n\n![Outline create template](/images/create-template.png)\n\n\nOnce you’re editing a template, simply highlight some text and click on the new \"placeholder\" icon in the toolbar to convert the text into a placeholder that can be filled out by anyone that creates a new doc from the template.\n\n\n### How to use a template\n\nSimply start a new doc, a \"Templates\" option will appear in the top right corner until the \ndocument is first saved.\n\n![Outline use a template](/images/use-template.png)\n\n\n\n### Other fixes and improvements\n\n- Click on the last updated timestamp below the document title now opens the history sidebar.\n- The behavior of the floating toolbar was improved.\n- It is now possible to toggle the state of checkboxes without explicitly going into \"Edit\".\n- When a document is publicly shared this is now denoted by a globe icon in the share button.\n- Fixed some ugly styling issues introduced by the latest Chrome releases.\n- Fixed an issue where after you have chosen a collection icon it might get reset if you continue to edit the collection name.\n- Fixed a case where websocket connections would not reconnect automatically.\n- Fixed an issue that would prevent editing the beginning of long collection descriptions.\n- Fixed rendering of GitHub Gist embeds.\n- Fixed an error that could on rare occasions cause the app to form a reload loop.","image":"https://www.getoutline.com/images/create-template.png"},"__N_SSG":true}