{"pageProps":{"title":"v0.43.0","slug":"v0.43.0","date":"2020-05-22T22:20:16.000Z","tag":"v0.43.0","content":"    \nThis is the biggest release of Outline since we first published the source code. The [editor](https://github.com/outline/rich-markdown-editor) is entirely rebuilt from the ground up for extensibility and speed, allowing us to move faster than ever before and is the culmination of more than 4 months of planning and work.\r\n\r\nThe improvements and fixes are almost too numerous to count, but the most important are listed below:\r\n\r\n### Enhancements\r\n\r\n- Document rendering performance increased by leaps and bounds, some of our extreme test documents went from 30seconds -> 300ms to render\r\n- A new menu for inserting blocks is much more intuitive than before, type \"/\" at the beginning of a line or hit the \"+\" button to trigger\r\n\r\n![Outline block menu](https://user-images.githubusercontent.com/380914/82714444-676a8f00-9c43-11ea-99f3-c89b6536c10b.gif)\r\n\r\n\r\n- Updating a document's title now also updates any links to the document in other docs automatically\r\n- \"Highlight\" now appears as an option in the formatting menu\r\n- It's now possible to type a url in markdown formatting\r\n- Quotes are converted to smart quotes as you type\r\n- Support for paragraph breaks in list items\r\n- It's now possible to choose the \"system\" theme and have Outline follow your system's dark mode preference – this is especially useful on macOS when dark mode is set to \"auto\" to go dark in the evenings.\r\n\r\n![Outline appearance preference](https://user-images.githubusercontent.com/380914/82713920-8a943f00-9c41-11ea-9f32-ce381b90f1c3.png)\r\n\r\n\r\n\r\n\r\n### Fixes\r\n\r\n- Support for alternative input methods, this finally brings the fix for typing in Chinese, Korean, Japanese, and all other languages that use a soft keyboard for input.\r\n- Restored the ability to disable embeds on a single doc in the context menu\r\n- Fixed some extra scrollbars that appear depending on your input device\r\n- It's now possible to save a document with only a title\r\n- Long titles now wrap onto multiple lines again\r\n- Document headings are centered correctly again when scrolled\r\n- Adding a new row to a table now respects column alignment\r\n- Improved key handling in link editor\r\n- Issues with markdown shortcuts surrounded in whitespace not applying","image":"https://user-images.githubusercontent.com/380914/82714444-676a8f00-9c43-11ea-99f3-c89b6536c10b.gif"},"__N_SSG":true}